export const responseMessages = {
  //series 2xx
  200: {
    fa: "درخواست موفقیت آمیز بود",
  },
  201: {
    fa: "منابع با موفقیت ایجاد شد",
  },
  202: {
    fa: "درخواست پذیرفته شد",
  },
  203: {
    fa: "اطلاعات نامعتبر است ",
  },
  204: {
    fa: "محتوایی برای نمایش موجود نیست",
  },

  //series 3xx
  300: {
    fa: "یکی از موارد را انتخاب کنید",
  },
  301: {
    fa: "صفحه انتقال یافته است",
  },
  302: {
    fa: "درخواست پیدا شد",
  },
  304: {
    fa: "اصلاح نشده",
  },
  305: {
    fa: "نیاز به اتصال پروکسی",
  },
  306: {
    fa: "نیاز به تغییر پروکسی",
  },

  //series 4xx
  400: {
    fa: "درخواست اشتباه",
  },
  401: {
    fa: "نیاز به احراز هویت",
  },
  403: {
    fa: "عدم دسترسی کاربر",
  },
  404: {
    fa: "منبعی یافت نشد",
  },

  //series 5xx
  500: {
    fa: "خطا از سمت سرور",
  },
  501: {
    fa: "خطا از سمت سرور",
  },
  503: {
    fa: "خطا از سمت سرور",
  },
  504: {
    fa: "خطا از سمت سرور",
  },
  505: {
    fa: "خطا از سمت سرور",
  },
  511: {
    fa: "خطا از سمت سرور",
  },

  //default
  success: { fa: "موفقیت آمیز بود" },
  failed: { fa: "درخواست ناموفق بود" },
};
